Repository: ktxyz/ktxyz
Catalog: _trans/texts_*.po
Languages: es, pl

# LICENSE_TEXT
source: Website published under the
es: Sitio web publicado bajo el
pl: Strona internetowa opublikowana pod

# LICENSE_NAME
source: MIT License
es: Licencia MIT
pl: Licencją MIT

source: BUILT WITH
es: CONSTRUIDO CON
pl: ZBUDOWANE Z

source: Portfolio
es: Cartera

# reverse-engineering-gym-app
source: Reverse-Engineering a Gym App for Fun & Friends
es: Ingeniería inversa de una aplicación de gimnasia para divertirse y hacer amigos
pl: Inżynieria wsteczna aplikacji siłowni dla zabawy i przyjaciół

# BriefBIO
source: I'm a 22-year-old self-taught developer from Poland, currently working as a gameplay engineer at a small indie company. I'm also pursuing a master's degree in Computer Science at <b>PJATK</b>. As a generalist, I have a broad range of skills, but I particularly focus on C++, Unreal Engine, and algorithms. I also frequently work with Python and web frameworks like Flask and Django.
es: Soy un desarrollador autodidacta polaco de 22 años que actualmente trabaja como ingeniero de jugabilidad en una pequeña empresa independiente. También estoy cursando un máster en Informática en PJATK. Como generalista, tengo un amplio abanico de habilidades, pero me centro especialmente en C++, Unreal Engine y algoritmos. También trabajo frecuentemente con Python y frameworks web como Flask y Django.
pl: Jestem 22 letnim developerem-samoukiem z Polski, aktualnie pracuję jako inżynier rozgrywki w małej firmie indie. Jestem w trakcie robienia magisterki na kierunku informatyka na <b>PJATK</b>. Jako generalista posiadam dosyć szerogą gamę umiejętności i doświadczenia, skupiam się jednak na C++, Unrealu i algorytmice, często pracuję również z Pythonem i frameworkami webowymi, takimi jak Flask i Django.

source: Gameplay Engineer
es: Ingeniero de jugabilidad
pl: Inżynier Rozgrywki

source: Software Developer
es: Desarrollador de software
pl: Programista

source: Junior Programmer
es: Programador junior
pl: Młodszy Programista

source: Self-Employed
es: Autónomos
pl: Samozatrudniony

# FIND_ME
source: Contact me
es: Encuéntrame
pl: Znajdź mnie

source: Skills
es: Habilidades
pl: Umiejętności

source: Blueprints
es: Blueprintos
pl: Blueprinty

source: Gameplay/AI
es: Jugabilidad/IA
pl: Rozgrywka/SI

source: Algorithms
es: Algoritmos
pl: Algorytmika

# DUALITY_WORK_DESC
source: It's and indie company so I wear many hats. I've worked on gameplay, UI, and more. I also created a custom plugins for the game. I'm looking out for games' performance and optimization.
es: Es una empresa independiente, así que llevo muchos sombreros. He trabajado en la jugabilidad, la interfaz de usuario y mucho más. También he creado plugins personalizados para el juego. Me ocupo del rendimiento y la optimización de los juegos.
pl: To niezależna firma, więc noszę wiele kapeluszy. Pracowałem nad rozgrywką, interfejsem użytkownika i nie tylko. Stworzyłem również niestandardowe wtyczki do gry. Dbam o wydajność i optymalizację gier.

# UNHOLY_DESC
source: My role in this project mainly boiled down to gameplay engineering. I was responsible for gameplay / interaction systems, some UI as well as more general tasks like performance optimization. I also worked on the lower-level stuff like plugin integrations, which was a lot of fun! And after over 2 years of my work, and even more from some of the team, the game is finally out!
es: Mi papel en este proyecto se redujo principalmente a la ingeniería de la jugabilidad. Fui responsable de los sistemas de juego e interacción, de algunas interfaces de usuario y de tareas más generales como la optimización del rendimiento. También trabajé en cosas de bajo nivel como integraciones de plugins, ¡lo cual fue muy divertido! Y después de más de 2 años de mi trabajo, y aún más de parte del equipo, ¡el juego por fin ha salido!
pl: Moja rola w tym projekcie sprowadzała się głównie do inżynierii rozgrywki. Byłem odpowiedzialny za systemy rozgrywki / interakcji, niektóre elementy interfejsu użytkownika, a także bardziej ogólne zadania, takie jak optymalizacja wydajności. Pracowałem również nad rzeczami niższego poziomu, takimi jak integracja wtyczek, co było świetną zabawą! I po ponad 2 latach mojej pracy, i nawet więcej od niektórych członków zespołu, gra w końcu wyszła!

# BARNFINDERS_DESC
source: I've worked on both released DLCs. I also created a feedback system for the base game. Bees are mine!
es: He trabajado en los dos DLC publicados. También he creado un sistema de feedback para el juego base. ¡Las abejas son mías!
pl: Pracowałem nad obydwoma wydanymi DLC. Stworzyłem również system opinii dla podstawowej wersji gry. Pszczoły są moje!

# SELFEMP_WORK_DESC
source: As a freelance developer, I created a variety of different software solutions for my clients. This included pretty much everything from web apps to C plugins for email servers. One of the more memorable projects was a rtsp overlay server written in Python!
es: Como desarrollador autónomo, creé una gran variedad de soluciones de software para mis clientes. Esto incluía prácticamente todo, desde aplicaciones web hasta plugins en C para servidores de correo electrónico. Uno de los proyectos más memorables fue un servidor rtsp escrito en Python.
pl: Jako niezależny programista tworzyłem wiele różnych rozwiązań programistycznych dla moich klientów. Obejmowało to prawie wszystko, od aplikacji internetowych po wtyczki C do serwerów poczty e-mail. Jednym z bardziej pamiętnych projektów był serwer nakładkowy rtsp napisany w Pythonie!

# TIPSY_DESC
source: Tipsy is my propriatery e-commerce platform for e-learning written from scratch in Django. It supports video, payments from multiple-vendors, promotions, coupons, newsletter, and more. It has been used in projects with over 5k users.
es: Tipsy es mi propia plataforma de comercio electrónico para e-learning escrita desde cero en Django. Es compatible con vídeo, pagos de múltiples proveedores, promociones, cupones, boletín de noticias, y mucho más. Se ha utilizado en proyectos con más de 5k usuarios.
pl: Tipsy to moja własna platforma e-commerce dla e-learningu napisana od podstaw w Django. Obsługuje wideo, płatności od wielu dostawców, promocje, kupony, newsletter i wiele więcej. Była używana w projektach z ponad 5 tysiącami użytkowników.

# ATINEA_WORK_DESC
source: During my time at Atinea, I worked on web development and provided some help with algorithms for a national programming competition for kids. I had the pleasure of working for/with one of the greatest competetive programmer in my country
es: Durante mi estancia en Atinea, trabajé en desarrollo web y ayudé con algoritmos para un concurso nacional de programación para niños. Tuve el placer de trabajar con uno de los mejores competetivo programadores de mi país.
pl: Podczas mojego pobytu w Atinea pracowałem nad tworzeniem stron internetowych i pomagałem w tworzeniu algorytmów dla krajowego konkursu programistycznego dla dzieci. Miałem przyjemność pracować dla jednego z najlepszych programistów kompetetywnych w moim kraju

# INSTALOGIK_DESC
source: Nation wide programming competetition for kids. I was a part of the original team behind both the platform itself and the tasks. Had the pleasure of working for/with one of the gratest competetive programmers in Poland's history - Adam GÄ…sienica-Samek.
es: Concurso nacional de programación para niños. Formé parte del equipo original de la plataforma y de las tareas.
pl: Ogólnokrajowy konkurs programistyczny dla dzieci. Byłem częścią oryginalnego zespołu stojącego zarówno za samą platformą, jak i zadaniami.

source: Show projects
es: Mostrar proyectos
pl: Pokaż projekty
